Revit 2026 API

# RebarConstraintsManagerClearHandleConstraintPairHighlighting Method

---

Clears all highlighting in all views.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ClearHandleConstraintPairHighlighting(
	Document aDoc
)
```
```vb
Public Sub ClearHandleConstraintPairHighlighting (
	aDoc As Document
)
```
```cpp
public:
void ClearHandleConstraintPairHighlighting(
	Document^ aDoc
)
```
```fsharp
member ClearHandleConstraintPairHighlighting :
        aDoc : Document -> unit
```

#### Parameters

aDoc Document

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If highlightHandleConstraintPairInAllViews has been called, then this method can be used to remove all highlighting.

#### Reference

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace